app/views/artists/index.html.erb

SELECT COUNT(*) FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
---
  <% @artists.each do |artist| %>
    <li><%= link_to artist.name, artist_songs_path(artist) %> All Their Songs! <%= artist.songs.count %></li>