app/controllers/songs_controller.rb

  def index
      if params[:artist_id]
      @songs = Artist.find(params[:artist_id]).songs
      else
        flash[:notice] =  "Artist not found."
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
SELECT "songs".* FROM "songs"